Revit 2025 API
AnalysisDisplayStyleVectorOrientation Enumeration
 Defines vector orientation for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AnalysisDisplayStyleVectorOrientation
Public Enumeration AnalysisDisplayStyleVectorOrientation
public enum class AnalysisDisplayStyleVectorOrientation
type AnalysisDisplayStyleVectorOrientation
Members
Member name | Value | Description
Linear | 0
ArcAroundVectorAxis | 1
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace